{
    "analyzer": {
        "sidebar": {
            "goBack": "Voltar",
            "overview": "Visão Geral",
            "architectureDiagram": "Diagrama de Arquitetura",
            "infrastructureCode": "Código de Infraestrutura",
            "s3Module": "Módulo S3",
            "iamModule": "Módulo IAM",
            "lambdaModule": "Módulo Lambda",
            "cloudtrailModule": "Módulo CloudTrail",
            "eventBridgeModule": "Módulo EventBridge",
            "terraformMainFile": "Terraform - Arquivo Main",
            "lambdaAggregatorFunction": "Função Lambda Aggregator",
            "lambdaAnalyzerFunction": "Função Lambda Analyzer"
        },
        "overview": {
            "title": "Serverless Logs Analyzer - Visão Geral",
            "description": "Este projeto demonstra o uso da AWS para gerar e analisar logs. Foi projetado para fornecer insights automatizados sobre as atividades da conta AWS por meio de uma arquitetura serverless que monitora, processa e analisa logs do CloudTrail em tempo real. O sistema captura automaticamente todas as chamadas de API e eventos de gerenciamento via CloudTrail, agrega arquivos de log diários para processamento eficiente e gera relatórios estatísticos abrangentes sobre padrões de uso de recursos, eventos de segurança e atividades operacionais. A solução utiliza funções Lambda, armazenamento S3 e EventBridge para criar um sistema de análise de logs escalável e de baixo custo que não requer gerenciamento de infraestrutura, enquanto fornece alta visibilidade sobre as atividades da conta AWS.",
            "githubLink": "Repositório Github",
            "dashboardLink1": "Para ver o dashboard criado com os logs processados, acesse a página do dashboard",
            "dashboardLink2": "aqui"
        },
        "architectureDiagram": {
            "title": "Diagrama de Arquitetura",
            "description": "O diagrama de arquitetura abaixo mostra a infraestrutura, que inclui:",
            "cloudtrail": "usado para rastrear todas as ações realizadas na conta AWS.",
            "eventbridge": "usado para disparar a função AWS Lambda quando um novo log é criado.",
            "lambda": "usado para analisar os logs e armazenar os resultados no Amazon S3.",
            "s3": "usado para armazenar os logs e os resultados.",
            "figcaption": "Diagrama criado com Lucidchart: "
        },
        "infrastructureCode": {
            "title": "Código de Infraestrutura",
            "description": "A infraestrutura é implementada através de uma arquitetura modular usando Terraform, que provisiona os seguintes componentes AWS organizados em 5 módulos principais.",
            "modulesTitle": "Módulos",
            "s3Module1": "Módulo S3: ",
            "s3Module2": "Este módulo é responsável por criar a infraestrutura de armazenamento com dois buckets S3. Ele configura o bucket de entrada para receber logs do CloudTrail e o bucket de saída para insights processados. Ambos os buckets são protegidos com versionamento ativado, criptografia AES256 e bloqueio completo de acesso público para garantir a proteção e conformidade dos dados.",
            "iamModule1": "Módulo IAM: ",
            "iamModule2": "O módulo de Gerenciamento de Identidade e Acesso (IAM) gerencia as permissões de segurança para as funções Lambda. Ele cria um papel de execução dedicado com permissões precisas para operações S3 (leitura, escrita, exclusão) em ambos os buckets e capacidades de log do CloudWatch, seguindo o princípio de privilégio mínimo para segurança aprimorada.",
            "lambdaModule1": "Módulo Lambda: ",
            "lambdaModule2": "Este módulo lida com as funções de computação sem servidor que processam os logs. Ele implementa duas funções Lambda Python 3.11 - o Analista para processar logs agregados e gerar insights, e o Agregador para consolidar arquivos de log diários. O módulo também configura gatilhos de eventos S3 e permissões apropriadas para integração sem problemas.",
            "cloudtrailModule1": "Módulo CloudTrail: ",
            "cloudtrailModule2": " O módulo CloudTrail configura um sistema abrangente de auditoria e registro de conta AWS. Ele configura uma trilha multi-região que captura eventos de gerenciamento, eventos de serviço global e eventos de dados S3, automaticamente entregando todos os logs para o bucket de entrada S3 com políticas de bucket apropriadas para armazenamento de log seguro.",
            "eventBridgeModule1": "Módulo EventBridge: ",
            "eventBridgeModule2": "Este módulo gerencia o sistema de agendamento automatizado para processamento de logs. Ele cria uma regra de evento do CloudWatch com uma expressão cron para disparar a função Lambda Agregador a cada 12 horas, garantindo a consolidação e processamento regulares de logs sem intervenção manual.",
            "moduleFilesDescription1": "Dentro de cada módulo, existe um ",
            "moduleFilesDescription2": "arquivo que define os recursos, um ",
            "moduleFilesDescription3": "arquivo que define as variáveis, e um ",
            "moduleFilesDescription4": "arquivo que define os outputs, quando necessário."
        },
        "s3Module": {
            "title": "Módulo S3",
            "description": "Este módulo é projetado para criar a infraestrutura de armazenamento com dois buckets S3, um para logs de entrada e outro para insights de saída. O bucket de entrada recebe logs do CloudTrail automaticamente, enquanto o bucket de saída armazena os relatórios JSON e CSV processados. Ambos os buckets são configurados com versionamento habilitado para rastreamento de alterações, criptografia AES256 no lado do servidor para proteção de dados e bloqueio completo de acesso público para garantir conformidade de segurança.",
            "featuresTitle": "Recursos",
            "s3DescriptionTitle": "Buckets S3: ",
            "s3Description": "Cria dois buckets S3 - um para receber logs do CloudTrail e outro para armazenar insights e relatórios processados.",
            "versioningDescriptionTitle": "Versionamento: ",
            "versioningDescription": "Habilita o versionamento em ambos os buckets para manter o histórico de objetos e fornecer capacidades de reversão para proteção de dados.",
            "encryptionDescriptionTitle": "Criptografia: ",
            "encryptionDescription": "Configura a criptografia AES256 por padrão em todos os objetos armazenados em ambos os buckets para garantir a segurança dos dados em repouso.",
            "publicAccessBlockDescriptionTitle": "Bloqueio de Acesso Público: ",
            "publicAccessBlockDescription": "Implementa restrições de acesso público abrangentes em ambos os buckets, bloqueando todos os tipos de acesso público, incluindo ACLs e políticas de bucket para prevenir acesso não autorizado.",
            "resourcesTitle": "Recursos",
            "buckets": {
                "bucketDescription": "O identificador exclusivo do bucket S3 dentro da AWS.",
                "forceDestroyDescription": "Se deve permitir a destruição do bucket mesmo que contenha objetos.",
                "tagsDescription": "Atribui um nome ao bucket para identificação e gerenciamento de recursos."
            },
            "versioning": {
                "bucket": "O bucket S3 para habilitar o versionamento.",
                "versoningConfiguration": "Configuração do bloco de configurações de versionamento."
            },
            "encryption": {
                "bucket": "O bucket S3 para habilitar a criptografia.",
                "rule": "Configuração do bloco de configurações de criptografia.",
                "applyServerSideEncryptionByDefault": "Configuração do bloco de configurações de criptografia.",
                "sseAlgorithm": "O algoritmo de criptografia do lado do servidor a ser usado."
            },
            "publicAccessBlock": {
                "bucket": "O bucket S3 para habilitar o bloqueio de acesso público.",
                "blockPublicAcls": "Se deve bloquear ACLs públicas para este bucket.",
                "blockPublicPolicy": "Se deve bloquear políticas de bucket públicas para este bucket.",
                "ignorePublicAcls": "Se deve ignorar ACLs públicas para este bucket.",
                "restrictPublicBuckets": "Se deve restringir políticas de bucket públicas para este bucket."
            }
        },
        "iamModule": {
            "title": "Módulo IAM",
            "description": "Este módulo é projetado para criar a infraestrutura de segurança e gerenciamento de acesso para as funções Lambda. Ele estabelece uma role IAM dedicado com permissões precisamente escopos seguindo o princípio de privilégio mínimo. A role permite que as funções Lambda interajam com buckets S3 para processamento de logs e CloudWatch para registro em log, enquanto restringe o acesso a apenas os recursos e ações necessários para o fluxo de trabalho de análise de logs.",
            "featuresTitle": "Recursos",
            "iamRoleTitle": "Role IAM: ",
            "iamRoleDescription": "Cria uma role de execução dedicado especificamente para funções Lambda com uma política de confiança que permite apenas o serviço Lambda assumir a role",
            "iamPolicyTitle": "Política IAM: ",
            "iamPolicyDescription": "Anexa uma política à role que concede as permissões necessárias para a função Lambda acessar o bucket S3 e os logs do CloudWatch.",
            "iamRole": {
                "name": "O nome da role IAM.",
                "assumeRolePolicy": "A política que permite ao serviço Lambda assumir a role. Define quais serviços são permitidos assumir a role, neste caso, apenas o serviço Lambda."
            },
            "iamPolicy": {
                "name": "O nome da política IAM.",
                "role": "A role IAM à qual a política será anexada.",
                "policy": "A política a ser anexada à role IAM. Concede as permissões necessárias para a função Lambda acessar o bucket S3 e os logs do CloudWatch."
            }
        },
        "lambdaModule": {
            "title": "Módulo Lambda",
            "description": "Este módulo é projetado para criar a infraestrutura de computação sem servidor para processamento e análise de logs. Ele estabelece duas funções Lambda especializadas que lidam com diferentes aspectos do fluxo de trabalho de análise de logs - uma para consolidar logs diários e outra para processar logs agregados para gerar insights. O módulo também configura os gatilhos, permissões e integrações necessários para habilitar a execução automática com base em eventos S3 e intervalos agendados.",
            "featuresTitle": "Recursos",
            "lambdaAggregatorFunctionTitle": "Função Lambda Aggregator: ",
            "lambdaAggregatorFunctionDescription": "Implanta uma função Lambda Python 3.11 que consolida vários arquivos de log diários em um único arquivo agregado, projetada para ser acionada por EventBridge agendamento.",
            "lambdaAnalyzerFunctionTitle": "Função Lambda Analyzer: ",
            "lambdaAnalyzerFunctionDescription": "Cria uma função Lambda Python 3.11 que processa logs agregados do CloudTrail e gera insights estatísticos, acionada automaticamente por eventos S3 ObjectCreated.",
            "lambdaPermissionsTitle": "Permissões Lambda: ",
            "lambdaPermissionsDescription": "Estabelece permissões adequadas permitindo que o serviço S3 invoque as funções Lambda mantendo as fronteiras de segurança.",
            "s3EventTriggerTitle": "Gatilhos S3: ",
            "eventBridgeTriggerDescription": "Configura notificações de bucket S3 para invocar automaticamente a função analisadora sempre que novos arquivos de log forem carregados no bucket de entrada.",
            "lambdaFunctions": {
                "functionName": "O nome da função Lambda.",
                "role": "A role que a função Lambda assume quando executa, fornecendo permissões necessárias.",
                "handler": "Entrada para a função Lambda, especificando o arquivo e a função a ser executada.",
                "runtime": "O ambiente de execução para a função Lambda.",
                "filename": "O caminho para o pacote de implantação contendo o código da função Lambda.",
                "sourceCodeHash": " O hash do código fonte para a função Lambda.",
                "timeout": "O tempo máximo de execução em segundos para a função Lambda.",
                "environment": "As variáveis de ambiente para a função Lambda.",
                "tags": "As tags da função Lambda."
            },
            "lambdaPermissions": {
                "statement_id": "O identificador único para a permissão.",
                "action": "A ação para permitir que a função Lambda realize.",
                "principal": "O serviço ou entidade que é permitido invocar a função Lambda.",
                "function_name": "O nome da função Lambda que é permitido ser invocada pelo principal.",
                "source_arn": "O ARN do recurso que é permitido invocar a função Lambda."
            },
            "s3EventTrigger": {
                "bucket": "O bucket S3 para configurar a notificação.",
                "action": "A ação para permitir que a função Lambda realize.",
                "depends_on": "Garante que a função Lambda exista antes que a notificação do bucket S3 seja configurada.",
                "lambda_function": "A função Lambda a ser acionada quando o evento ocorrer e o tipo de evento que aciona a função Lambda."
            }
        },
        "cloudtrailModule": {
            "title": "Módulo CloudTrail",
            "description": "Este módulo é projetado para criar uma infraestrutura abrangente de auditoria e registro de contas AWS. Ele estabelece um CloudTrail multirregional que captura todos os eventos de gerenciamento, eventos de serviços globais e eventos de dados S3 em toda a conta AWS. O módulo entrega automaticamente todos os logs capturados para o bucket S3 de entrada designado e configura as políticas de bucket necessárias para permitir o armazenamento seguro dos logs, mantendo controles de acesso adequados para o serviço CloudTrail.",
            "featuresTitle": "Recursos",
            "cloudtrailTrailConfigurationTitle": "Configuração do CloudTrail: ",
            "cloudtrailTraiConfigurationlDescription": "Cria um trail multirregional que monitora as atividades da conta AWS em todas as regiões, incluindo serviços globais como IAM, Route53 e CloudFront para fornecer visibilidade completa. O CloudTrail também captura todas as operações do plano de gerenciamento, como criação, exclusão e alterações de configuração de recursos para uma auditoria completa da conta.",
            "s3IntegrationTitle": "Integração com S3: ",
            "s3IntegrationDescription": "Entrega automaticamente todos os logs capturados para o bucket S3 de entrada e estabelece políticas de bucket seguras que concedem ao serviço CloudTrail as permissões mínimas necessárias para gravar logs e ler ACLs do bucket, mantendo as fronteiras de segurança.",
            "cloudtrailConfiguration": {
                "name": "O nome do CloudTrail.",
                "s3BucketName": "O nome do bucket S3 para armazenar os logs do CloudTrail.",
                "isMultiRegionTrail": "Se o trail captura eventos de todas as regiões AWS ou apenas da região onde foi criado.",
                "includeGlobalServiceEvents": "Se deve incluir eventos de serviços globais da AWS como IAM e STS.",
                "enableLogging": "Se deve habilitar o registro de logs.",
                "eventSelector": "Bloco de configuração que define quais tipos de eventos o trail deve capturar.",
                "dependsOn": "Garante que o CloudTrail seja criado apenas após o estabelecimento das dependências especificadas."
            },
            "s3BucketPolicy": {
                "bucket": "O bucket S3 para configurar a política.",
                "policy": "O documento de política em JSON que define as permissões e controles de acesso para o bucket, especificando quem pode realizar quais ações no bucket e em seus objetos."
            }
        },
        "eventBridgeModule": {
            "title": "Módulo EventBridge",
            "description": "Este módulo é projetado para criar uma infraestrutura de agendamento automatizado para tarefas periódicas de processamento de logs. Ele estabelece uma regra de evento do CloudWatch com agendamento baseado em cron que aciona automaticamente a função Lambda Aggregator a cada 12 horas para consolidar os logs diários do CloudTrail. O módulo configura os alvos de evento necessários, permissões e entrega de payload para permitir uma integração perfeita entre o serviço de agendamento e as funções serverless.",
            "featuresTitle": "Recursos",
            "cloudwatchEventRuleTitle": "Regra de Evento do CloudWatch: ",
            "cloudwatchEventRuleDescription": "Cria uma regra do EventBridge que aciona automaticamente a função Lambda Analyzer sempre que novos arquivos de log são enviados para o bucket S3 de entrada.",
            "lambdaTargetTitle": "Configuração de Alvo Lambda: ",
            "lambdaTargetDescription": "Define a função Lambda Aggregator como alvo para os eventos agendados, com configuração adequada de payload incluindo o ID da conta para processamento contextual.",
            "eventBridgePermissionsTitle": "Permissões do EventBridge: ",
            "eventBridgePermissionsDescription": "Configura permissões na Lambda para permitir que o serviço EventBridge invoque a função Aggregator, mantendo as fronteiras de segurança e prevenindo acessos não autorizados.",
            "cloudwatchEventRule": {
                "name": "O identificador único do nome para a regra do EventBridge dentro da conta AWS.",
                "description": "A descrição da regra do EventBridge.",
                "scheduleExpression": "A expressão cron ou rate que define quando a regra deve ser acionada, suportando tanto sintaxe cron quanto formatos de agendamento baseados em rate."
            },
            "lambdaTarget": {
                "rule": "O nome da regra do EventBridge à qual o alvo está vinculado.",
                "targetId": "O identificador único para o alvo dentro da regra do EventBridge.",
                "arn": "O ARN (Amazon Resource Name) da função Lambda a ser invocada pela regra do EventBridge.",
                "input": "O payload codificado em JSON a ser passado para a função Lambda."
            },
            "eventBridgePermissions": {
                "statement_id": "O identificador único para a permissão.",
                "action": "A ação AWS Lambda que está sendo permitida, neste caso 'lambda:InvokeFunction' para permitir a execução da função.",
                "function_name": "O nome da função Lambda que pode ser invocada pelo serviço EventBridge.",
                "principal": "O serviço ou entidade que pode invocar a função Lambda, neste caso 'events.amazonaws.com' para o EventBridge.",
                "source_arn": "O ARN da regra do EventBridge que está autorizada a invocar a função Lambda."
            }
        },
        "terraformMainFile": {
            "title": "Terraform - Arquivo Main",
            "description1": "O ",
            "description2": " arquivo serve como a configuração central para implantar e gerenciar a infraestrutura na AWS usando Terraform. Ele orquestra a configuração dos módulos e recursos previamente definidos, garantindo que todos os componentes sejam corretamente provisionados e interconectados para formar um ambiente de infraestrutura coeso."
        },
        "lambdaAggregatorFunction": {
            "title": "Função Lambda Aggregator",
            "description": "A função Lambda Aggregator é uma função serverless Python 3.11 projetada para consolidar vários arquivos de log diários em um único arquivo agregado. Esta função é acionada pelo EventBridge a cada 12 horas e realiza operações de consolidação, compressão e limpeza de logs para otimizar o armazenamento e preparar os dados para análise.",
            "purposeTitle": "Objetivo ",
            "purposes": {
                "consolidateTitle": "Consolidar ",
                "consolidateDescription": "vários arquivos de log diários em um único arquivo agregado.",
                "reduceTitle": "Reduzir ",
                "reduceDescription": "o número de arquivos individuais para processamento eficiente.",
                "cleanupTitle": "Limpar ",
                "cleanupDescription": "os arquivos de log originais para otimizar os custos de armazenamento.",
                "prepareTitle": "Preparar ",
                "prepareDescription": "os dados para análise pela função analisadora."
            },
            "fullCode": "Código Completo",
            "functionWorkflow": "Fluxo de Trabalho da Função",
            "triggerAndInitialization": {
                "title": "1. Gatilho e Inicialização",
                "description": "A função é acionada pelo EventBridge a cada 12 horas e o bucket de destino é definido."
            },
            "dynamicPath": {
                "title": "2. Construção de Caminho Dinâmico",
                "description": "Calcula a data atual e cria um prefixo dinâmico para os arquivos de log, no formato AWSLogs/[AccountID]/CloudTrail/us-east-1/YYYY/MM/DD/"
            },
            "fileDiscovery": {
                "title": "3. Descoberta e Filtro de Arquivos",
                "description": "Lista todos os objetos na pasta do dia atual, filtra para arquivos .json.gz apenas e exclui arquivos já agregados para evitar processamento repetido."
            },
            "dataAggregation": {
                "title": "4. Agregação de Dados",
                "description": "Faz o download de cada arquivo de log individual, descomprime o conteúdo gzip em memória, extrai o array Records de cada arquivo e consolida todos os registros em um único array."
            },
            "outputFile": {
                "title": "5. Criação de Arquivo de Saída",
                "description": "Gera um nome de arquivo baseado em timestamp, comprime os dados agregados usando gzip e envia o arquivo consolidado para o S3 no formato YYYY-MM-DD-HH:MM-aggregated.json.gz."
            },
            "cleanup": {
                "title": "6. Operações de Limpeza",
                "description": "Exclui os arquivos de log originais enquanto preserva o novo arquivo agregado, otimizando os custos de armazenamento e organização."
            },
            "results": {
                "title": "7. Resultados",
                "description1": "A função é concluída com sucesso, consolidando os logs e otimizando o armazenamento.",
                "description2": "Antes da agregação, os arquivos são os seguintes:",
                "description3": "Após a agregação, os arquivos são os seguintes:"
            }
        },
        "lambdaAnalyzerFunction": {
            "title": "Função Lambda Analyzer",
            "description": "A função Lambda Analyzer é uma função serverless Python 3.11 projetada para processar arquivos de log agregados do CloudTrail e gerar insights estatísticos abrangentes sobre as atividades da conta AWS. Esta função é acionada automaticamente por eventos S3 ObjectCreated quando arquivos de log agregados são carregados e produz relatórios detalhados em formatos JSON e CSV para análise adicional.",
            "purposeTitle": "Objetivo ",
            "purposes": {
                "processTitle": "Processar ",
                "processDescription": "arquivos de log agregados do CloudTrail para extrair insights significativos.",
                "analyzeTitle": "Analisar ",
                "analyzeDescription": "atividades da conta AWS e padrões de uso.",
                "generateTitle": "Gerar ",
                "generateDescription": "relatórios estatísticos sobre eventos, recursos, regiões e atividades de usuário.",
                "exportTitle": "Exportar ",
                "exportDescription": "resultados em vários formatos (JSON e CSV) para integração com painéis."
            },
            "handlerCode": "Código Handler",
            "analyzerCode": "Código Analyzer",
            "exportCode": "Código Export",
            "functionWorkflow": "Fluxo de Trabalho da Função",
            "trigger": {
                "title": "1. Gatilho e Processamento de Eventos S3",
                "description": "A função é acionada automaticamente por eventos S3 ObjectCreated quando novos arquivos são carregados no bucket de entrada. Extrai o nome do bucket e a chave do objeto do payload do evento S3."
            },
            "fileDownload": {
                "title": "2. Download e Configuração de Caminho",
                "description": "Faz o download do arquivo acionado do S3 para o diretório /tmp da Lambda para processamento local e extrai o nome de arquivo base para uso futuro."
            },
            "fileDecompression": {
                "title": "3. Descompressão de Arquivo",
                "description": "Descomprime o arquivo de log gzip para extrair o conteúdo JSON, criando um arquivo JSON legível no armazenamento temporário da Lambda."
            },
            "fileValidation": {
                "title": "4. Validação e Processamento de Arquivo Agregado",
                "description": "Valida se o arquivo é um arquivo de log agregado antes do processamento. Se válido, chama o módulo analisador para processar os logs e define os caminhos de saída para os arquivos de insights."
            },
            "dataAnalysis": {
                "title": "5. Análise de Dados e Geração de Insights",
                "description": "Processa o arquivo de log JSON para extrair e contar várias métricas, incluindo nomes de eventos, tipos de recursos, regiões, IPs de origem, tipos de eventos, categorias de eventos e tipos de identidade de usuário."
            },
            "dataExport": {
                "title": "6. Exportação e Conversão de Formato",
                "description": "Exporta os insights gerados para ambos os formatos JSON (estrutura de dados completa) e CSV (apenas contagens de eventos) para diferentes casos de uso e integrações."
            },
            "output": {
                "title": "7. Upload para S3",
                "description": "Carrega os insights gerados para o bucket S3 de saída nos caminhos especificados, completando o processo de análise."
            },
            "results": {
                "title": "8. Resultados",
                "description": "Os arquivos de saída são estruturados da seguinte forma:"
            }
        },
        "dashboard": {
            "title": "Dashboard",
            "description1": "O Dashboard é uma interface de visualização interativa que transforma os dados de atividade da conta AWS processados pela função Lambda Analyzer em gráficos e métricas intuitivos. Este dashboard fornece aos stakeholders insights em tempo real sobre padrões de uso da AWS, eventos de segurança e tendências operacionais por meio de representações visuais de frequência de eventos, distribuição regional, atividades de usuário, utilização de recursos e análise de IPs de origem.",
            "description2": "Para ver o dashboard criado com os logs processados, ",
            "description3": "vá para a página do dashboard."
        },
        "dashboardPage": {
            "title": "Dashboard - 18/07/2025",
            "description1": "Este dashboard visualiza dados reais do CloudTrail de uma conta AWS em uso, mostrando ",
            "description2": " capturados durante o período de análise. Os dados revelam que a conta opera principalmente na região ",
            "description3": " com atividade dominada por ",


            "description5": "As operações mais frequentes incluem",
            "description6": "e ",
            "description7": "indicando atividades de monitoramento e segurança.",
            "description8": "geraram a maioria das atividades, seguidas por ",
            "description9": "com a maioria do tráfego originando de um endereço IP específico",
            "description10": "A utilização de recursos mostra interações com",
            "description11": "e",
            "description12": "fornecendo insights sobre gerenciamento de armazenamento e operações de identidade em todo o ambiente AWS.",
            "commonEventsTitle": "Eventos Comuns",
            "sourceIPsTitle": "Contagem de IPs de Origem",
            "resourceCountsTitle": "Contagem de Recursos",
            "activityCountsTitle": "Contagem de Atividades",
            "totalEvents": "eventos totais",
            "events": "eventos",
            "calls": "chamadas",
            "operations": "operações"
        }
    }
}